{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_copy", 
      "name": "id", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv1_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv1_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv1_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv1_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv1_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv1_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv1_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv1_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv2_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv2_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv2_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv2_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv2_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv2_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv2_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv2_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv3_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv3_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv3_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv3_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv3_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv3_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv3_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv3_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "in_stem_maxpool_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv4_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv4_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv4_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv4_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv4_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv4_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv4_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv4_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "in_stem_concat_1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[26, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv5_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv5_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv5_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv5_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv5_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv5_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv5_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv5_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv6_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv6_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv6_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv6_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv6_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv6_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv6_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv6_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv7_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv7_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv7_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv7_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv7_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv7_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv7_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv7_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv8_7*1_conv2d_weight", 
      "attrs": {
        "kernel": "(7, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv8_7*1_conv2d", 
      "attrs": {
        "kernel": "(7, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv8_7*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv8_7*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv8_7*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv8_7*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv8_7*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv8_7*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv9_1*7_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv9_1*7_conv2d", 
      "attrs": {
        "kernel": "(1, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv9_1*7_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv9_1*7_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv9_1*7_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv9_1*7_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv9_1*7_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv9_1*7_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv10_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv10_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv10_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv10_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv10_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv10_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv10_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv10_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "in_stem_concat_2", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[51, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv11_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in_stem_conv11_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv11_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv11_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv11_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in_stem_conv11_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in_stem_conv11_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in_stem_conv11_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "in_stem_maxpool_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "in_stem_concat_3", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "in1A_avgpool_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv1_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv1_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv1_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv1_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv1_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv1_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv1_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv1_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv2_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv2_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv2_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv2_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv2_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv2_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv2_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv2_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv3_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv3_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv3_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv3_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv3_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv3_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv3_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv3_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv4_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv4_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv4_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv4_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv4_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv4_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv4_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv4_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv5_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv5_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv5_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv5_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv5_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv5_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv5_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 1], [133, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv5_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv6_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv6_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv6_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv6_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv6_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv6_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv6_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv6_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv7_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in1A_conv7_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in1A_conv7_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv7_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv7_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in1A_conv7_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in1A_conv7_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in1A_conv7_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "in1A_concat_1", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[103, 0, 0], [111, 0, 0], [127, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "in2A_avgpool_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv1_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv1_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv1_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv1_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv1_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv1_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv1_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0], [158, 0, 1], [159, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv1_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv2_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv2_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[152, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv2_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv2_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv2_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv2_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv2_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[163, 0, 0], [164, 0, 0], [165, 0, 0], [166, 0, 1], [167, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv2_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv3_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv3_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[152, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv3_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv3_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv3_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv3_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv3_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[171, 0, 0], [172, 0, 0], [173, 0, 0], [174, 0, 1], [175, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv3_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv4_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv4_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv4_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv4_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv4_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv4_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv4_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0], [182, 0, 1], [183, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv4_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv5_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv5_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[152, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv5_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv5_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv5_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv5_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv5_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[187, 0, 0], [188, 0, 0], [189, 0, 0], [190, 0, 1], [191, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv5_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv6_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv6_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv6_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv6_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv6_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv6_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv6_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0], [198, 0, 1], [199, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv6_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv7_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in2A_conv7_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in2A_conv7_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv7_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv7_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in2A_conv7_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in2A_conv7_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[203, 0, 0], [204, 0, 0], [205, 0, 0], [206, 0, 1], [207, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in2A_conv7_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "in2A_concat_1", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[161, 0, 0], [169, 0, 0], [185, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "in3A_avgpool_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv1_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in3A_conv1_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv1_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv1_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv1_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv1_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in3A_conv1_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[213, 0, 0], [214, 0, 0], [215, 0, 0], [216, 0, 1], [217, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in3A_conv1_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv2_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in3A_conv2_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[210, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv2_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv2_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv2_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv2_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in3A_conv2_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[221, 0, 0], [222, 0, 0], [223, 0, 0], [224, 0, 1], [225, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in3A_conv2_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv3_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in3A_conv3_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[210, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv3_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv3_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv3_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv3_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in3A_conv3_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[229, 0, 0], [230, 0, 0], [231, 0, 0], [232, 0, 1], [233, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in3A_conv3_1*1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv4_3*3_conv2d_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in3A_conv4_3*3_conv2d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv4_3*3_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv4_3*3_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv4_3*3_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv4_3*3_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in3A_conv4_3*3_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[237, 0, 0], [238, 0, 0], [239, 0, 0], [240, 0, 1], [241, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "in3A_conv4_3*3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv5_1*1_conv2d_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "in3A_conv5_1*1_conv2d", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[210, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "in3A_conv5_1*1_batchnorm_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv5_1*1_batchnorm_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv5_1*1_batchnorm_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "in3A_conv5_1*1_batchnorm_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "in3A_conv5_1*1_batchnorm", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0], [248, 0, 1], [249, 0, 1]]
    }, 
    {
      "op": "Activation", 
